// Для каждого дочернего класса Car создайте:
// - private readonly либо private static readonly поле с названием марки авто

// - enum со списком комплектаций комплектации( для разных марок будут различаться)

// - функцию getCost, которая принимает элемент enum'а, 
//  читает из файла с комплектациями стоимость и возвращает её

// - файл со стоимостью данной марки
// (название файла должно содержать марку авто;
// расширение, формат содержимого файла и полное название не важно),

// например:
// file bmw.txt: comfort - 40000, luxury - 80000;
// file ferrari: basic - 75000, extra - 500000;
// В случае, если файл не содержит информацию по комплектации, вывести: данного авто нет в продаже



