// + Напишите программу для вычисления общей стоимости покупки телефонов.
// Вы будете продолжать покупать телефоны 
//(подсказка: циклы!),
// пока у вас не закончатся деньги на банковском счете. 
//Вы также будете покупать аксессуары для каждого из телефонов.

//+ После того, как вы посчитаете сумму покупки,
// прибавьте налог, затем выведите на экран вычисленную сумму покупки,
// правильно отформатировав её.

//+ Наконец, сверьте сумму с балансом вашего банковского счета,
// чтобы понять можете вы себе это позволить или нет.

//+ Вы должны настроить некоторые константы для «ставки налога», 
//«цены телефона», «цены аксессуара», 
//также как и переменную для вашего «баланса банковского счета».

//+ Вам следует определить функции для вычисления налога
// и для форматирования цены со знаком валюты 
//и округлением до двух знаков после запятой.