// Есть массив кандидатов, например: 
// { name : 'John', reviews: Map[['Mark', 5.8], ['Joshua', 9.3]]}
// { name : 'Bob', reviews: Map[['Mark', 5.9], ['Joshua', 9.0]]}
// { name : 'Thomas', reviews: Map[['Mark', 4], ['Joshua', 10]]}
// И коллекция ревьюверов: Map[['Mark', 7], ['Joshua', 8]]
// Нужно нанять только 1 кандидата, каждый ревьювер выставил кандидату оценку
// Также каждый ревьювер имеет свою компетенцию в баллах, 
// которая показывает, как сильно его оценка влияет на результат
// Вычислить, кто из кандидатов все-таки будет принят






// ЗДЕСЬ ТОЖЕ ХОТЕЛОСЬ БЫ ПОНЯТЬ КАК ДЕЙСТВОВАТЬ.
// НО БЕЗ ПОДСКАЗКИ ДАЖЕ НЕ ПОНЯТНО С ЧЕГО НАЧАТЬ